

import 'package:flutter_drug/model/disease.dart';
import 'package:flutter_drug/provider/view_state_list_model.dart';

class GoodAtModel extends ViewStateListModel<Disease>{

  List<String> _goodAt;

  List<String> get goodAt => _goodAt;

  set goodAt (List<String> goodAt){
    _goodAt = goodAt;
    notifyListeners();
  }

  @override
  Future<List<Disease>> loadData() async {
    return await Future.delayed(Duration(seconds: 0), () {
      List<Disease> results = List();
      results.add(Disease("消化科",["胃痛","便秘","呃逆","胆石症","肠易激综合征",
        "湿阻","胃炎","便血","肝硬化","胰腺炎", "溃疡性结肠炎","慢性胃炎","消化性溃疡",
        "腹痛","脂肪肝","黄疸","萎缩性胃炎", "慢性肝炎","消化不良","腹胀","肠炎",
        "十二指肠溃疡","功能性胃肠病","腹泻","肝炎","胆囊炎","胃溃疡","胃痞病"]));
      results.add(Disease("妇科", ["月经不调","子宫肌瘤","人工授精","卵巢早衰","痛经",
        "更年期综合征","复发性自然流产","月经过少","带下症","不孕", "试管婴儿","多囊卵巢综合症","妇科炎症",
        "产后调理","子宫内膜异位症","子宫脱垂","卵巢囊肿", "先兆流产","外阴白斑"]));
      results.add(Disease("肾病科", ["泌尿系感染","肾结石","蛋白尿","淋证","肾病综合征",
        "多囊肾病","腰痛","肾衰","肾炎","糖尿病肾病", "肾功能不全","血尿"]));
      results.add(Disease("皮肤科", ["痘痘痤疮","银屑病","脱发","淋病","聚合性痤疮",
        "面部色斑","荨麻疹","白发","尖锐湿疣","皮炎", "白癜风","脚气","梅毒",
        "湿疹","疱疹","冻疮","生殖器疱疹", "中医美容","带状疱疹","灰指甲","疖"]));
      results.add(Disease("肿瘤科", ["肺癌","乳腺癌","前列腺癌","大肠癌","胃癌",
        "食道癌","肾癌","肝癌","直肠癌","多发性骨髓瘤", "胰腺癌","结肠癌","恶性淋巴瘤",
        "宫颈癌","膀胱癌","垂体瘤"]));
      results.add(Disease("呼吸科", ["感冒","肺炎","肺结核","咳嗽","支气管扩张症",
        "睡眠呼吸暂停综合征","喘症","慢阻肺","慢性乙型肝炎","哮喘", "肺气肿","支气管炎","肺间质纤维化"]));
      results.add(Disease("男科", ["早泄","前列腺炎","勃起功能障碍","男性不育","精索静脉曲张"]));
      results.add(Disease("内分泌科", ["糖尿病","内分泌失调","甲亢","代谢综合征","甲减",
        "甲状腺病","痛风"]));
      results.add(Disease("神经科", ["失眠","运动神经元病","脑梗塞后遗症","头痛","多发性硬化",
        "脑溢血后遗症","眩晕","脑出血","神经系统疑难杂症","脑卒中", "三叉神经痛","脑血管病","癫痫","痴呆"]));
      results.add(Disease("内科", ["肿瘤术后调理","水肿"]));
      results.add(Disease("儿科", ["小儿感冒","小儿厌食症","小儿妇科","语言发育迟缓","小儿腹泻",
        "小儿哮喘","多动症","小儿反复呼吸道感染","情绪障碍","小儿消化不良", "抽动症","小儿脾虚","注意力缺陷","小儿肺炎",
        "手足口病","孤独症谱系障碍","小儿遗尿","疳证","腮腺炎", "智力低下","小儿肌性斜颈"]));
      results.add(Disease("骨科", ["脊椎病","腱鞘炎","骨质增生","腰椎间盘突出","筋膜炎",
        "肩周炎","脊柱小关节紊乱","漆关节损伤","漆关节炎","骨质疏松", "股骨头坏死"]));
      results.add(Disease("血液科", ["贫血","溶血性贫血","紫癜","白血病","再生障碍性贫血",
        "血小板较少性紫癜","缺铁性贫血","过敏性紫癜","巨幼红细胞性贫血"]));
      results.add(Disease("针灸科", ["面瘫","蜂疗"]));
      results.add(Disease("疼痛科", ["颈肩腰腿疼","带状疱疹后遗神经痛"]));
      results.add(Disease("全科", ["虚汗","性早熟","矮小症"]));
      results.add(Disease("心理科", ["抑郁症","精神分裂症","焦虑症","强迫症","恐惧症", "双相障碍"]));
      results.add(Disease("心内科", ["高血压","冠心病","高脂血症","心力衰竭","心律失常",
        "动脉硬化","心肌炎","冠脉支架康复","心痛"]));
      results.add(Disease("眼科", ["青少年近视","麦粒肿","视神经萎缩","结膜炎","青光眼",
        "视神经病变","角膜炎","视网膜病变","红眼病","白内障","霰粒肿","视神经炎"]));
      results.add(Disease("耳鼻喉科", ["中耳炎","咽炎","淋巴结炎","耳鸣","腺样体肥大",
        "耳聋","喉炎","鼻炎","扁桃体炎","鼻窦炎","慢性扁桃体炎"]));
      results.add(Disease("风湿免疫科", ["风湿","SAPHO综合征","类风湿关节炎","类风湿","血清阴性脊柱关节病",
        "系统性红斑狼疮","银屑病关节炎","成人斯蒂尔病","强直性脊柱炎","干燥综合征","脚趾脓疱病"]));
      results.add(Disease("肛肠科", ["痔疮","直肠脱垂","肛裂","肠息肉","肛瘘",
        "肛周脓肿","肠梗阻"]));
      results.add(Disease("外科", ["疝气","阑尾炎"]));
      results.add(Disease("口腔科", ["口腔溃疡","夜磨牙症","牙痛","咬合与颞下頜关节病","牙龈炎",
        "灼口综合征","牙周病","牙体牙髓病"]));
      results.add(Disease("周围血管科", ["静脉曲张","坏疽","糖尿病足","脉管炎","下肢动脉硬化闭塞症",
        "下肢静脉曲张","下肢静脉血栓","主动脉瘤"]));
      results.add(Disease("治未病科", ["亚健康调理","减肥","慢性疲劳","抗衰老","增高助长"]));
      results.add(Disease("泌尿外科", ["前列腺增生","泌尿性结石","女性压力性尿失禁"]));
      results.add(Disease("乳腺科", ["乳腺增生","肉芽肿性乳腺炎","乳腺炎","乳痛症","乳房结节","浆细胞性乳腺炎"]));
      results.add(Disease("疮疡科", ["肿疡","丹毒","皮肤溃疡","流注","痛疽","流痰","疔疮","瘰疬","红丝疔","褥疮"]));
      return results;
    });
  }
}










